/*
SQLyog Ultimate v11.24 (32 bit)
MySQL - 5.7.25-log : Database - house
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`house` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `house`;

/*Table structure for table `tb_admin` */

DROP TABLE IF EXISTS `tb_admin`;

CREATE TABLE `tb_admin` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `username` varchar(64) NOT NULL COMMENT '用户名',
  `avatar` varchar(255) DEFAULT NULL COMMENT '头像',
  `password` varchar(64) DEFAULT NULL COMMENT '密码',
  `email` varchar(64) DEFAULT NULL COMMENT '邮箱',
  `status` int(5) DEFAULT NULL COMMENT '状态',
  `created` datetime DEFAULT NULL COMMENT '创建时间',
  `last_login` datetime DEFAULT NULL COMMENT '最后一次登录',
  `phone` bigint(20) DEFAULT NULL COMMENT '手机号',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `tb_admin` */

insert  into `tb_admin`(`id`,`username`,`avatar`,`password`,`email`,`status`,`created`,`last_login`,`phone`) values (1,'lbb',NULL,'96e79218965eb72c92a549dd5a330112','1532771197@qq.com',0,'2020-12-13 14:21:58','2020-12-13 14:22:00',12333313333),(2,'admin',NULL,'96e79218965eb72c92a549dd5a330112','3333771197@qq.com',0,'2021-02-10 20:09:54','2021-02-10 20:09:52',11333323332),(3,'luu',NULL,'96e79218965eb72c92a549dd5a330112','333321@qq.com',0,'2021-03-05 20:10:40','2021-02-10 20:10:43',23344412333),(4,'123','','96e79218965eb72c92a549dd5a330112','333321@qq.com',NULL,NULL,NULL,23344412333);

/*Table structure for table `tb_commission_contract` */

DROP TABLE IF EXISTS `tb_commission_contract`;

CREATE TABLE `tb_commission_contract` (
  `id` bigint(18) NOT NULL AUTO_INCREMENT,
  `host_id` bigint(18) DEFAULT NULL,
  `house_id` bigint(18) DEFAULT NULL,
  `house_price` float DEFAULT NULL,
  `signing_date` datetime DEFAULT NULL,
  `due_date` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tb_commission_contract` */

/*Table structure for table `tb_estate` */

DROP TABLE IF EXISTS `tb_estate`;

CREATE TABLE `tb_estate` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) DEFAULT NULL COMMENT '楼盘名称',
  `province` varchar(10) DEFAULT NULL COMMENT '所在省',
  `city` varchar(10) DEFAULT NULL COMMENT '所在市',
  `area` varchar(10) DEFAULT NULL COMMENT '所在区',
  `address` varchar(100) DEFAULT NULL COMMENT '具体地址',
  `year` varchar(10) DEFAULT NULL COMMENT '建筑年代',
  `type` varchar(10) DEFAULT NULL COMMENT '建筑类型',
  `property_cost` varchar(10) DEFAULT NULL COMMENT '物业费',
  `property_company` varchar(20) DEFAULT NULL COMMENT '物业公司',
  `developers` varchar(20) DEFAULT NULL COMMENT '开发商',
  `created` datetime DEFAULT NULL COMMENT '创建时间',
  `updated` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1006 DEFAULT CHARSET=utf8 COMMENT='楼盘表';

/*Data for the table `tb_estate` */

insert  into `tb_estate`(`id`,`name`,`province`,`city`,`area`,`address`,`year`,`type`,`property_cost`,`property_company`,`developers`,`created`,`updated`) values (1001,'中远两湾城','上海市','上海市','普陀区','远景路97弄','2001','塔楼/板楼','1.5','上海中远物业管理发展有限公司','上海万业企业股份有限公司','2018-11-06 23:00:20','2018-11-06 23:00:23'),(1002,'上海康城','上海市','上海市','闵行区','莘松路958弄','2001','塔楼/板楼','1.5','盛孚物业','闵行房地产','2018-11-06 23:02:30','2018-11-27 23:02:33'),(1003,'保利西子湾','上海市','上海市','松江区','广富林路1188弄','2008','塔楼/板楼','1.75','上海保利物业管理','上海城乾房地产开发有限公司','2018-11-06 23:04:22','2018-11-06 23:04:25'),(1004,'万科城市花园','上海市','上海市','松江区','广富林路1188弄','2002','塔楼/板楼','1.5','上海保利物业管理','上海城乾房地产开发有限公司','2018-11-13 16:43:40','2018-11-13 16:43:42'),(1005,'上海阳城','上海市','上海市','闵行区','罗锦路888弄','2002','塔楼/板楼','1.5','上海莲阳物业管理有限公司','上海莲城房地产开发有限公司','2018-11-06 23:23:52','2018-11-06 23:23:55');

/*Table structure for table `tb_host` */

DROP TABLE IF EXISTS `tb_host`;

CREATE TABLE `tb_host` (
  `host_id` bigint(18) NOT NULL AUTO_INCREMENT,
  `host_name` varchar(22) DEFAULT NULL,
  `host_username` varchar(22) DEFAULT NULL,
  `host_password` varchar(22) DEFAULT NULL,
  `host_phone` bigint(18) DEFAULT NULL,
  `host_sex` varchar(22) DEFAULT NULL,
  `host_account` bigint(22) DEFAULT NULL,
  `host_email` varchar(30) DEFAULT NULL,
  PRIMARY KEY (`host_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

/*Data for the table `tb_host` */

insert  into `tb_host`(`host_id`,`host_name`,`host_username`,`host_password`,`host_phone`,`host_sex`,`host_account`,`host_email`) values (1,'刘德华','11111','111111',12233212321,'男',44022211122232212,'2222222@qq.com');

/*Table structure for table `tb_house_base` */

DROP TABLE IF EXISTS `tb_house_base`;

CREATE TABLE `tb_house_base` (
  `house_id` bigint(20) unsigned zerofill NOT NULL AUTO_INCREMENT COMMENT 'id',
  `house_address` varchar(64) DEFAULT NULL COMMENT '房屋地址：城市/行政区/小区/地址',
  `house_host_id` bigint(20) DEFAULT NULL COMMENT '房主',
  `house_city` varchar(20) DEFAULT '暂不清楚' COMMENT '城市',
  `house_district` varchar(64) DEFAULT NULL COMMENT '区域：如花都区',
  `house_number` varchar(64) DEFAULT NULL COMMENT '房屋门牌号',
  `house_layout` varchar(64) DEFAULT NULL COMMENT '房屋布局',
  `house_rental_price` float DEFAULT NULL COMMENT '房屋出租价格',
  `house_village` varchar(20) DEFAULT NULL COMMENT '小区',
  `house_rental_area` int(10) DEFAULT '0' COMMENT '房屋出租面积',
  `house_floor` varchar(64) DEFAULT NULL COMMENT '房屋楼层',
  `house_parking` varchar(64) DEFAULT '暂无信息' COMMENT '房屋车位',
  `house_orientation` varchar(64) DEFAULT NULL COMMENT '房屋朝向',
  `move_in` varchar(64) DEFAULT '随时入住' COMMENT '是否入住',
  `house_elevator` varchar(64) DEFAULT '无' COMMENT '是否有电梯',
  `house_water` varchar(64) DEFAULT '民水' COMMENT '房屋用水',
  `house_electricity` varchar(64) DEFAULT '民电' COMMENT '房屋用电',
  `house_gas` varchar(64) DEFAULT '有' COMMENT '房屋燃气',
  `house_heating` varchar(64) DEFAULT '暂无信息' COMMENT '房屋采暖',
  `house_tenancy` varchar(64) DEFAULT '一年以内' COMMENT '房屋租期',
  `Showings` varchar(64) DEFAULT '随时可看' COMMENT '看房预约',
  `house_rental_method` varchar(64) DEFAULT '整租' COMMENT '房租出租方式：整租/合租/不限',
  `house_longitude` varchar(64) DEFAULT NULL COMMENT '房屋经度',
  `house_latitude` varchar(64) DEFAULT NULL COMMENT '房屋纬度',
  `house_update_time` datetime DEFAULT NULL COMMENT '房源维护时间',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `house_note` varchar(255) DEFAULT NULL COMMENT '房屋备注',
  `house_payment_method` varchar(64) DEFAULT NULL COMMENT '房屋付款方式：季付/月付',
  `house_state` tinyint(4) DEFAULT NULL COMMENT '出租状态，1-未出租，2-已出租，3-不可用，0-未发布',
  `house_pic_name` varchar(255) DEFAULT NULL COMMENT '房屋图片地址',
  `house_tag` varchar(255) DEFAULT NULL COMMENT '标签',
  `deleted` int(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`house_id`)
) ENGINE=InnoDB AUTO_INCREMENT=94 DEFAULT CHARSET=utf8;

/*Data for the table `tb_house_base` */

insert  into `tb_house_base`(`house_id`,`house_address`,`house_host_id`,`house_city`,`house_district`,`house_number`,`house_layout`,`house_rental_price`,`house_village`,`house_rental_area`,`house_floor`,`house_parking`,`house_orientation`,`move_in`,`house_elevator`,`house_water`,`house_electricity`,`house_gas`,`house_heating`,`house_tenancy`,`Showings`,`house_rental_method`,`house_longitude`,`house_latitude`,`house_update_time`,`create_time`,`house_note`,`house_payment_method`,`house_state`,`house_pic_name`,`house_tag`,`deleted`) values (00000000000000000001,'广州-白云-隆泰逸品君庭',4,'广州','白云','12栋2单元101室A卧','3室2厅2卫 ',1000,'隆泰逸品君庭',110,'中楼层/11层','免费使用','东','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.26517','23.158452','2021-03-16 15:24:59','2021-03-16 15:25:01','**户型方方正正**\n	厅出阳台视野宽阔，自带明火功能，交通便利，配套完善，人车分流，闹中取静便利地铁5号线猎德站,楼下就有公交线路.\n**项目由五栋塔楼组成**\n	户型涵盖1房至4房，面积在75-201方之间。项目与城市主干道金穗路、黄埔大道距离适中，交通方便又不失恬静','月付',2,'1_1.png,1_2.png,1_3.png,1_4.png,','0,1,2,3,',0),(00000000000000000002,'广州-白云-梓元岗路',3,'广州','白云','12栋2单元101室A卧','2室1厅1卫',1950,'梓元岗路',79,'高楼层/9层','暂无数据','东','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.35631316288','23.124489145911','2021-03-15 16:00:00','2021-03-16 15:25:01','【户型介绍】\n户型方方正正，厅出阳台视野宽阔，自带明火功能，交通便利，配套完善，人车分流，闹中取静\n\n【周边配套】\n珠江新城中轴线，地理位置优越，有天汇广场，广州百货，太阳城新天地百货，太古汇商城，迪卡龙运动超市；交通便利地铁5号线猎德站,楼下就有公交线路.\n\n【小区介绍】\n嘉裕丹顿阳光位于珠江新城东区，北靠海安路，西临猎德路，东面就是丽江花园，南向临靠尚东美御及幼儿园。项目由五栋塔楼组成，户型涵盖1房至4房，面积在75-201方之间。项目与城市主干道金穗路、黄埔大道距离适中，交通方便又不失恬静','月付',2,'1_1.png,1_2.png,1_3.png,1_4.png,','1,2,4,',0),(00000000000000000003,'广州-从化-珠江壹城',1,'广州','从化','12栋2单元101室A卧','3室2厅2卫 ',1400,'珠江壹城',119,'高楼层/27层','暂无数据','南','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.53028555031','23.477107455916','2021-03-16 15:24:59','2021-03-16 15:25:01','【户型介绍】\n户型方方正正，厅出阳台视野宽阔，自带明火功能，交通便利，配套完善，人车分流，闹中取静\n\n【周边配套】\n珠江新城中轴线，地理位置优越，有天汇广场，广州百货，太阳城新天地百货，太古汇商城，迪卡龙运动超市；交通便利地铁5号线猎德站,楼下就有公交线路.\n\n【小区介绍】\n嘉裕丹顿阳光位于珠江新城东区，北靠海安路，西临猎德路，东面就是丽江花园，南向临靠尚东美御及幼儿园。项目由五栋塔楼组成，户型涵盖1房至4房，面积在75-201方之间。项目与城市主干道金穗路、黄埔大道距离适中，交通方便又不失恬静','月付',2,'1_1.png,1_2.png,1_3.png,1_4.png,',NULL,0),(00000000000000000004,'黄埔-文冲-石化生活区 ',4,'广州','黄埔','12栋2单元101室A卧','2室1厅1卫',1233,'石化生活区',65,'高楼层/6层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.478351','23.111169','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',1,'1_1.png,1_2.png,1_3.png,','1,3,4,',0),(00000000000000000005,'广州-增城-融创御园',3,'广州','增城','12栋2单元101室A卧','3室2厅2卫',1900,'融创御园',89,'低楼层/29层','暂无数据','东','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.478351','23.111169','2021-03-16 15:24:59','2021-03-16 15:25:01','稼南雅筑，集团连锁服务式公寓，全新配套600元起，超千平方园林式空中花园，采光好，交通便利，全智能化24小时监控管家式服务','月付',2,'1_1.jpg,1_2.jpg,1_3.jpg,1_4.jpg,1_5.jpg,','0,1,2,',0),(00000000000000000006,'增城-白江-东景华庭',3,'广州','增城','12栋2单元101室A卧','2室2厅1卫',123,'东景华庭',83,'中楼层/11层','暂无数据','南','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','114.03840647447','22.669434745559','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',2,'1_1.png,1_2.png,1_3.png,1_4.png,',NULL,0),(00000000000000000007,'龙华区-龙华中心-美丽365花园 ',3,'深圳','龙华','12栋2单元101室A卧','2室1厅1卫 ',4600,'美丽365花园',74,'中楼层/8层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','114.03840647447','22.669434745559','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',2,'1_1.png,1_2.png,1_3.png,1_4.png,1_5.png,1_6.png,1_7.png,','1,2,3,',0),(00000000000000000008,'龙华区-龙华中心-微棠新青年社区',2,'深圳','龙华','12栋2单元101室A卧','1室0厅1卫  ',1399,'微棠新青年社区',30,'高楼层/15层','租用车位','东','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','114.01078034078','22.658667246515','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',2,'1_1.png,1_2.png,1_3.png,1_4.png,','0,1,3,',0),(00000000000000000009,'深圳-龙华-天玑公馆 ',4,'深圳','龙华','12栋2单元101室A卧','3室1厅1卫',5600,'天玑公馆 ',83,'中楼层/41层','租用车位','东','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','114.045333','22.680803','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',1,'1_1.png,1_2.png,1_3.png,1_4.png,','4,5,',0),(00000000000000000010,'深圳-南山-友邻公寓',3,'深圳','南山','12栋2单元101室A卧','1室0厅1卫',4300,'友邻公寓',29,'高楼层/30层','租用车位','北','随时入住','无','民水','民电','有','暂无数据','2年以内','需提前预约','整租','113.93632','22.537291','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',2,'1_1.png,1_2.png,1_3.png,',NULL,0),(00000000000000000011,'深圳-南山-鼎胜金域世家',2,'深圳','南山','12栋2单元101室A卧','3室2厅2卫',8500,'鼎胜金域世家',90,'中楼层/28层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.953944','22.58772','2021-03-16 15:24:59','2021-03-16 15:25:01','【户型介绍】\n户型方方正正，厅出阳台视野宽阔，自带明火功能，交通便利，配套完善，人车分流，闹中取静\n\n【周边配套】\n珠江新城中轴线，地理位置优越，有天汇广场，广州百货，太阳城新天地百货，太古汇商城，迪卡龙运动超市；交通便利地铁5号线猎德站,楼下就有公交线路.\n\n【小区介绍】\n嘉裕丹顿阳光位于珠江新城东区，北靠海安路，西临猎德路，东面就是丽江花园，南向临靠尚东美御及幼儿园。项目由五栋塔楼组成，户型涵盖1房至4房，面积在75-201方之间。项目与城市主干道金穗路、黄埔大道距离适中，交通方便又不失恬静','月付',2,'1_3.png,1_1.png,1_2.png,1_3.png,dd.png,','0,2,4,',0),(00000000000000000012,'茂名-信宜-汇美苑',1,'茂名','信宜','12栋2单元101室A卧','3室1厅1卫 ',123,'汇美苑',79,'高楼层/9层','暂无数据','东','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.953944','23.158452','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',1,'1_1.png,1_2.png,1_3.png,','1,3,5,',0),(00000000000000000013,'广州-白云-汇美苑',2,'广州','白云','12栋2单元101室A卧','3室1厅1卫 ',123,'汇美苑',79,'高楼层/9层','暂无数据','东','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.953944','23.158452','2021-03-16 15:24:59','2021-03-16 15:25:01','【交通出行】\n乘坐地铁：距离龙华地铁站D出口620米，地铁4号线直达关内通往福田口岸，联通深圳北站9号线、3号线、2号线、1号线、7号线。\n\n【出租原因】\n业主诚心出租，屋里地板重新装的瓷砖，墙面新弄了，厨房卫生间很干净，觉得沙发占空间可以撤掉\n\n【周边配套】\n商超：华润万家、大润发、华富市场（菜市场）（步行650米）、山姆会员店。\n购物综合：壹方天地（步行600米）。\n教育：龙华第二实验\n医院：深圳市龙华区人民医院（三甲）。\n公园：龙华公园、篮球场。','月付',1,'1_1.jpg,1_2.jpg,1_3.jpg,1_4.jpg,1_5.jpg,','0,1,2,',0),(00000000000000000014,'广州-白云-机场路-广花三路 ',4,'广州','白云','12栋2单元101室A卧','3室1厅1卫 ',123,'汇美苑',79,'高楼层/9层','租用车位','北','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','合租','113.953944','23.158452','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',1,'1_1.jpg,1_2.jpg,1_3.jpg,1_4.jpg,1_5.jpg,1_6.jpg,1_7.jpg,1_8.jpg,',NULL,0),(00000000000000000015,'广州-白云-汇美苑',2,'广州','白云','12栋2单元101室A卧','3室1厅1卫 ',1232,'汇美苑',79,'高楼层/9层','暂无数据','东','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.953944','23.158452','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',1,'1_2.jpg,1_3.jpg,','1,2,3,',0),(00000000000000000016,'广州-白云-机场路-广花三路 ',1,'广州','白云','12栋2单元101室A卧','3室1厅1卫 ',123,'汇美苑',79,'高楼层/9层','暂无数据','东','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.953944','23.158452','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',1,'1_1.png,1_2.png,1_3.png,1_4.png,',NULL,0),(00000000000000000017,'广州-白云-机场路-广花三路 ',4,'广州','白云','12栋2单元101室A卧','3室1厅1卫 ',123,'汇美苑',79,'高楼层/9层','暂无数据','东','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.953944','23.158452','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',1,'225b7a2b-8576-4197-96e7-38cde473873a.780x439.jpg,','0,1,2,',0),(00000000000000000018,'广州-白云-机场路-广花三路 ',3,'广州','白云','12栋2单元101室A卧','3室1厅1卫 ',123,'汇美苑',79,'高楼层/9层','暂无数据','西','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.953944','23.158452','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',1,'1_1.png,1_2.png,1_3.png,1_4.png,',NULL,0),(00000000000000000022,'广州-花都-华南理工大学广州学院',1,'广州','花都','12栋302号','2室1厅1卫 ',2000,'华南理工大学广州学院',122,'高楼层/9层','暂无数据','西','随时入住','无','民水','民电','有','暂无数据','1年以内','随时可看','整租','113.953944','23.158452','2021-04-07 17:09:19','2021-04-07 17:09:19','无','月付',1,'1_4.jpg,1_5.jpg,1_6.jpg,1_7.jpg,1_8.jpg,','0,1,2,3,',0),(00000000000000000023,'白云-机场路-穗云苑 ',1,'广州','白云','12栋2单元101室A卧','3室2厅2卫 ',2000,'隆泰逸品君庭',110,'中楼层/11层','免费使用','东','随时入住','无','民水','民电','有','暂无数据','1年以内','随时可看','整租','113.953944','23.158452','2021-03-16 15:25:01','2021-03-16 15:24:59','无','月付',1,'1_1.png,1_2.png,1_3.png,1_4.png,','0,1,2,3,',0),(00000000000000000025,'信宜-东镇镇-玉都新城 ',1,'茂名','信宜','12栋2单元101室A卧','3室2厅2卫 ',2000,'玉都新城 ',110,'中楼层/11层','免费使用','东','随时入住','无','民水','民电','有','暂无数据','1年以内','随时可看','整租','113.953944','23.158452','2021-03-16 15:25:01','2021-03-16 15:24:59','无','月付',2,'1_1.png,1_2.png,1_3.png,1_4.png,','0,1,2,3,',0),(00000000000000000026,'茂名-信宜-玉都新城 ',4,'茂名','信宜','12栋2单元101室A卧','3室2厅2卫 ',2000,'玉都新城 ',110,'中楼层/11层','免费使用','东','随时入住','无','民水','民电','有','暂无数据','1年以内','随时可看','整租','113.953944','23.158452','2021-03-16 15:25:01','2021-03-16 15:24:59','无','月付',1,'1_4.png,1_5.png,1_4.png,1_5.png,','0,1,2,3,',0),(00000000000000000027,'信宜-东镇镇-玉都新城 ',1,'茂名','信宜','12栋2单元101室A卧','3室2厅2卫 ',2000,'玉都新城 ',110,'中楼层/11层','免费使用','东','随时入住','无','民水','民电','有','暂无数据','1年以内','随时可看','整租','113.953944','23.158452','2021-03-16 15:25:01','2021-03-16 15:24:59','无','月付',2,'1_1.png,1_2.png,1_3.png,1_4.png,','0,1,2,3,',0),(00000000000000000038,'广州-白云-梅贻琦时代',2,'广州','白云','C19栋511房','2室1厅1卫',1000,'梅贻琦时代',0,'高楼层/9层','暂无信息','东','随时入住','无','民水','民电','有','暂无信息','一年以内','随时可看','整租','113.953944','23.158452','2021-04-14 13:21:54','2021-04-14 13:21:54',NULL,'月付',1,'1_1.png,1_2.png,1_3.png,1_4.png,1_5.png,1_6.png,1_7.png,',NULL,0),(00000000000000000039,'广州-白云-没有房房房',3,'广州','白云','22栋302号','2室1厅1卫',2000,'没有房房房',0,'高楼层/9层','暂无信息','东','随时入住','无','民水','民电','有','暂无信息','一年以内','随时可看','整租','113.953944','23.158452','2021-04-14 13:37:06','2021-04-14 13:37:06',NULL,'月付',1,'1_1.png,1_2.png,1_3.png,1_4.png,',NULL,0),(00000000000000000044,'广州-白云-广花三路',3,'广州','白云','13栋302号房','3室2厅2卫',2000,'广花三路',0,'高楼层/9层','暂无信息',NULL,'随时入住','无','民水','民电','有','暂无信息','一年以内','随时可看','整租',NULL,NULL,'2021-04-16 02:13:24','2021-04-16 02:13:24',NULL,'月付',0,'1_1.png,1_2.png,1_3.png,1_4.png,',NULL,1),(00000000000000000050,'广州-白云-雅虎小区',1,'广州','白云','12栋201号','3室2房2卫',2000,'雅虎小区',0,'高楼层/9层','暂无信息',NULL,'随时入住','无','民水','民电','有','暂无信息','一年以内','随时可看','整租',NULL,NULL,'2021-04-16 10:27:35','2021-04-16 10:27:35',NULL,'月付',1,NULL,NULL,0),(00000000000000000056,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元101室A卧','1室1厅1卫 ',3400,'龙泽榕园  ',46,'中楼层/8层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','1年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-16 10:52:47','2021-04-16 10:52:47','无','月付',1,'1_1.png,1_2.png,1_3.png,1_4.png,','0,1,2,3,',0),(00000000000000000057,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元102室A卧','1室1厅2卫',3401,'龙泽榕园  ',46,'中楼层/9层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','2年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-16 10:52:47','2021-04-16 10:52:47','无','月付',1,'1_1.png,1_2.png,1_3.png,1_5.png,','0,1,2,4,',0),(00000000000000000058,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元103室A卧','1室1厅3卫',3402,'龙泽榕园  ',46,'中楼层/10层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','3年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-16 10:52:47','2021-04-16 10:52:47','无','月付',1,'1_1.png,1_2.png,1_3.png,1_6.png,','0,1,2,5,',0),(00000000000000000059,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元104室A卧','1室1厅4卫',3403,'龙泽榕园  ',46,'中楼层/11层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','4年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-16 10:52:47','2021-04-16 10:52:47','无','月付',1,'1_1.png,1_2.png,1_3.png,1_7.png,','0,1,2,6,',0),(00000000000000000060,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元105室A卧','1室1厅5卫',3404,'龙泽榕园  ',46,'中楼层/12层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','5年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-16 10:52:47','2021-04-16 10:52:47','无','月付',1,'1_1.png,1_2.png,1_3.png,1_8.png,','0,1,2,7,',0),(00000000000000000061,'龙华区-龙华中心-龙泽榕园 ',3,'上海','龙华','12栋2单元101室A卧','1室1厅1卫 ',123,'龙泽榕园  ',30,'中楼层/8层','租用车位','西','随时入住','无','民水','民电','有','暂无信息','一年以内','随时可看','整租','114.02886846199','23.111169','2021-04-19 22:13:57','2021-04-19 22:13:57','稼南雅筑，集团连锁服务式公寓，全新配套600元起，超千平方园林式空中花园，采光好，交通便利，全智能化24小时监控管家式服务','月付',1,NULL,'0,1,2,3,',0),(00000000000000000062,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元101室A卧','1室1厅1卫 ',3400,'龙泽榕园  ',46,'中楼层/8层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','1年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-26 14:56:52','2021-04-26 14:56:52','无','月付',1,'1_1.png,1_2.png,1_3.png,1_4.png,','0,1,2,3,',0),(00000000000000000063,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元102室A卧','1室1厅2卫',3401,'龙泽榕园  ',46,'中楼层/9层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','2年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-26 14:56:52','2021-04-26 14:56:52','无','月付',1,'1_1.png,1_2.png,1_3.png,1_5.png,','0,1,2,4,',0),(00000000000000000064,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元103室A卧','1室1厅3卫',3402,'龙泽榕园  ',46,'中楼层/10层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','3年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-26 14:56:52','2021-04-26 14:56:52','无','月付',1,'1_1.png,1_2.png,1_3.png,1_6.png,','0,1,2,5,',0),(00000000000000000065,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元104室A卧','1室1厅4卫',3403,'龙泽榕园  ',46,'中楼层/11层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','4年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-26 14:56:52','2021-04-26 14:56:52','无','月付',1,'1_1.png,1_2.png,1_3.png,1_7.png,','0,1,2,6,',0),(00000000000000000066,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元105室A卧','1室1厅5卫',3404,'龙泽榕园  ',46,'中楼层/12层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','5年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-26 14:56:52','2021-04-26 14:56:52','无','月付',1,'1_1.png,1_2.png,1_3.png,1_8.png,','0,1,2,7,',0),(00000000000000000067,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元101室A卧','1室1厅1卫 ',3400,'龙泽榕园  ',46,'中楼层/8层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','1年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-26 14:57:01','2021-04-26 14:57:01','无','月付',1,'1_1.png,1_2.png,1_3.png,1_4.png,','0,1,2,3,',0),(00000000000000000068,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元102室A卧','1室1厅2卫',3401,'龙泽榕园  ',46,'中楼层/9层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','2年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-26 14:57:01','2021-04-26 14:57:01','无','月付',0,'1_1.png,1_2.png,1_3.png,1_5.png,','0,1,2,4,',0),(00000000000000000069,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元103室A卧','1室1厅3卫',3402,'龙泽榕园  ',46,'中楼层/10层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','3年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-26 14:57:01','2021-04-26 14:57:01','无','月付',0,'1_1.png,1_2.png,1_3.png,1_6.png,','0,1,2,5,',0),(00000000000000000070,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元104室A卧','1室1厅4卫',3403,'龙泽榕园  ',46,'中楼层/11层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','4年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-26 14:57:01','2021-04-26 14:57:01','无','月付',0,'1_1.png,1_2.png,1_3.png,1_7.png,','0,1,2,6,',0),(00000000000000000071,'龙华区-龙华中心-龙泽榕园 ',2,'深圳','龙华','12栋2单元105室A卧','1室1厅5卫',3404,'龙泽榕园  ',46,'中楼层/12层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','5年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-26 14:57:01','2021-04-26 14:57:01','无','月付',0,'1_1.png,1_2.png,1_3.png,1_8.png,','0,1,2,7,',0),(00000000000000000072,'广州-增城-融创御园',3,'广州','增城','12栋2单元101室A卧','3室2厅2卫',1900,'融创御园',89,'低楼层/29层','暂无数据','东','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.478351','23.111169','2021-03-16 15:24:59','2021-03-16 15:25:01','稼南雅筑，集团连锁服务式公寓，全新配套600元起，超千平方园林式空中花园，采光好，交通便利，全智能化24小时监控管家式服务','月付',1,'1_1.jpg,1_2.jpg,1_3.jpg,1_4.jpg,1_5.jpg,','0,1,2,',0),(00000000000000000073,'广州-白云-汇美苑',2,'广州','白云','12栋2单元101室A卧','3室1厅1卫 ',123,'汇美苑',79,'高楼层/9层','暂无数据','东','随时入住','无','民水','民电','有','暂无数据','1年以内','需提前预约','整租','113.953944','23.158452','2021-03-16 15:24:59','2021-03-16 15:25:01','无','月付',1,'1_1.jpg,1_2.jpg,1_3.jpg,',NULL,0),(00000000000000000074,'广州-白云-梅贻琦时代',2,'广州','白云','C19栋511房','2室1厅1卫',1000,'梅贻琦时代',0,'高楼层/9层','暂无信息','东','随时入住','无','民水','民电','有','暂无信息','一年以内','随时可看','整租','113.953944','23.158452','2021-04-14 13:21:54','2021-04-14 13:21:54',NULL,'月付',1,'1_1.png,1_2.png,1_3.png,1_4.png,1_5.png,1_6.png,1_7.png,',NULL,0),(00000000000000000075,'广州-白云-没有房房房',3,'广州','白云','22栋302号','2室1厅1卫',2000,'没有房房房',0,'高楼层/9层','暂无信息','东','随时入住','无','民水','民电','有','暂无信息','一年以内','随时可看','整租','113.953944','23.158452','2021-04-14 13:37:06','2021-04-14 13:37:06',NULL,'月付',2,'1_1.png,1_2.png,1_3.png,1_4.png,',NULL,0),(00000000000000000076,'广州-白云-雅虎小区',1,'广州','白云','12栋201号','3室2房2卫',2000,'雅虎小区',0,'高楼层/9层','暂无信息',NULL,'随时入住','无','民水','民电','有','暂无信息','一年以内','随时可看','整租',NULL,NULL,'2021-04-16 10:27:35','2021-04-16 10:27:35',NULL,'月付',1,NULL,NULL,0),(00000000000000000077,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元101室A卧','1室1厅1卫 ',3400,'龙泽榕园  ',46,'中楼层/8层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','1年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-27 00:40:29','2021-04-27 00:40:29','无','月付',0,'1_1.png,1_2.png,1_3.png,1_4.png,','0,1,2,3,',0),(00000000000000000078,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元102室A卧','1室1厅2卫',3401,'龙泽榕园  ',46,'中楼层/9层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','2年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-27 00:40:29','2021-04-27 00:40:29','无','月付',0,'1_1.png,1_2.png,1_3.png,1_5.png,','0,1,2,4,',0),(00000000000000000079,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元103室A卧','1室1厅3卫',3402,'龙泽榕园  ',46,'中楼层/10层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','3年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-27 00:40:29','2021-04-27 00:40:29','无','月付',0,'1_1.png,1_2.png,1_3.png,1_6.png,','0,1,2,5,',0),(00000000000000000080,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元104室A卧','1室1厅4卫',3403,'龙泽榕园  ',46,'中楼层/11层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','4年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-27 00:40:29','2021-04-27 00:40:29','无','月付',0,'1_1.png,1_2.png,1_3.png,1_7.png,','0,1,2,6,',0),(00000000000000000081,'深圳-龙华-龙泽榕园  ',1,'深圳','龙华','12栋2单元105室A卧','1室1厅5卫',3404,'龙泽榕园  ',46,'中楼层/12层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','5年以内','随时可看','整租','114.02886846199','22.652504095653','2021-04-27 00:40:29','2021-04-27 00:40:29','无','月付',0,'1_1.jpg,1_2.jpg,1_3.jpg,1_4.jpg,1_5.jpg,1_6.jpg,1_7.jpg,1_8.jpg,','0,1,2,',0),(00000000000000000082,'广州-白云-广花三路',11,'广州','白云','302号','3室1厅',2000,'广花三路',30,'3楼','暂无信息','南','随时入住','无','民水','民电','有','暂无信息','一年以内','随时可看','整租',NULL,NULL,'2021-05-06 14:33:59','2021-05-06 14:33:59',NULL,'月付',1,'1_1.png,1_2.png,1_3.png,1_4.png,1_5.png,1_6.png,1_7.png,','1,2,3,',0),(00000000000000000083,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元101室A卧','1室1厅1卫 ',3400,'龙泽榕园  ',46,'中楼层/8层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','1年以内','随时可看','整租','114.02886846199','22.652504095653','2021-05-06 21:49:34','2021-05-06 21:49:34','无','月付',0,'1_1.png,1_2.png,1_3.png,1_4.png,','0,1,2,3,',0),(00000000000000000084,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元102室A卧','1室1厅2卫',3401,'龙泽榕园  ',46,'中楼层/9层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','2年以内','随时可看','整租','114.02886846199','22.652504095653','2021-05-06 21:49:34','2021-05-06 21:49:34','无','月付',0,'1_1.png,1_2.png,1_3.png,1_5.png,','0,1,2,4,',0),(00000000000000000085,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元103室A卧','1室1厅3卫',3402,'龙泽榕园  ',46,'中楼层/10层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','3年以内','随时可看','整租','114.02886846199','22.652504095653','2021-05-06 21:49:34','2021-05-06 21:49:34','无','月付',0,'1_1.png,1_2.png,1_3.png,1_6.png,','0,1,2,5,',0),(00000000000000000086,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元104室A卧','1室1厅4卫',3403,'龙泽榕园  ',46,'中楼层/11层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','4年以内','随时可看','整租','114.02886846199','22.652504095653','2021-05-06 21:49:34','2021-05-06 21:49:34','无','月付',0,'1_1.png,1_2.png,1_3.png,1_7.png,','0,1,2,6,',0),(00000000000000000087,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元105室A卧','1室1厅5卫',3404,'龙泽榕园  ',46,'中楼层/12层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','5年以内','随时可看','整租','114.02886846199','22.652504095653','2021-05-06 21:49:34','2021-05-06 21:49:34','无','月付',0,'1_1.png,1_2.png,1_3.png,1_8.png,','0,1,2,7,',0),(00000000000000000088,'广州-白云-广花三路',2,'广州','白云','333号','3室2厅2卫',2000,'广花三路',20,'9层','暂无信息','南','随时入住','无','民水','民电','有','暂无信息','一年以内','随时可看','整租',NULL,NULL,'2021-05-07 08:23:14','2021-05-07 08:23:14',NULL,'月付',1,'225b7a2b-8576-4197-96e7-38cde473873a.780x439.jpg,','4,2,1,',0),(00000000000000000089,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元101室A卧','1室1厅1卫 ',3400,'龙泽榕园  ',46,'中楼层/8层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','1年以内','随时可看','整租','114.02886846199','22.652504095653','2021-05-07 08:46:12','2021-05-07 08:46:12','无','月付',0,'1_1.png,1_2.png,1_3.png,1_4.png,','0,1,2,3,',0),(00000000000000000090,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元102室A卧','1室1厅2卫',3401,'龙泽榕园  ',46,'中楼层/9层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','2年以内','随时可看','整租','114.02886846199','22.652504095653','2021-05-07 08:46:12','2021-05-07 08:46:12','无','月付',0,'1_1.png,1_2.png,1_3.png,1_5.png,','0,1,2,4,',0),(00000000000000000091,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元103室A卧','1室1厅3卫',3402,'龙泽榕园  ',46,'中楼层/10层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','3年以内','随时可看','整租','114.02886846199','22.652504095653','2021-05-07 08:46:12','2021-05-07 08:46:12','无','月付',0,'1_1.png,1_2.png,1_3.png,1_6.png,','0,1,2,5,',0),(00000000000000000092,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元104室A卧','1室1厅4卫',3403,'龙泽榕园  ',46,'中楼层/11层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','4年以内','随时可看','整租','114.02886846199','22.652504095653','2021-05-07 08:46:12','2021-05-07 08:46:12','无','月付',0,'1_1.png,1_2.png,1_3.png,1_7.png,','0,1,2,6,',0),(00000000000000000093,'龙华区-龙华中心-龙泽榕园 ',1,'深圳','龙华','12栋2单元105室A卧','1室1厅5卫',3404,'龙泽榕园  ',46,'中楼层/12层','租用车位','南','随时入住','无','民水','民电','有','暂无数据','5年以内','随时可看','整租','114.02886846199','22.652504095653','2021-05-07 08:46:12','2021-05-07 08:46:12','无','月付',0,'1_1.png,1_2.png,1_3.png,1_8.png,','0,1,2,7,',0);

/*Table structure for table `tb_house_price` */

DROP TABLE IF EXISTS `tb_house_price`;

CREATE TABLE `tb_house_price` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `house_id` bigint(20) DEFAULT NULL COMMENT '房屋id',
  `house_now_price` float DEFAULT NULL COMMENT '房屋现在价格',
  `house_expect_price` float DEFAULT NULL COMMENT '期望价格',
  `user_id` bigint(20) DEFAULT NULL COMMENT '用户id',
  `state` int(2) DEFAULT NULL COMMENT '状态',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `message` longtext COMMENT '留言',
  `host_id` bigint(20) DEFAULT NULL COMMENT '房东id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

/*Data for the table `tb_house_price` */

insert  into `tb_house_price`(`id`,`house_id`,`house_now_price`,`house_expect_price`,`user_id`,`state`,`create_time`,`message`,`host_id`) values (8,1,6570,2000,1,2,'2021-05-06 12:17:37','降一点点可以吗',1),(9,1,2000,1000,3,3,'2021-05-15 18:01:49','便宜点好吗',1),(10,25,2000,100,10,1,'2021-06-05 05:17:52','dnmd',1);

/*Table structure for table `tb_house_resources` */

DROP TABLE IF EXISTS `tb_house_resources`;

CREATE TABLE `tb_house_resources` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `title` varchar(100) DEFAULT NULL COMMENT '房源标题',
  `estate_id` bigint(20) DEFAULT NULL COMMENT '楼盘id',
  `building_num` varchar(5) DEFAULT NULL COMMENT '楼号（栋）',
  `building_unit` varchar(5) DEFAULT NULL COMMENT '单元号',
  `building_floor_num` varchar(5) DEFAULT NULL COMMENT '门牌号',
  `rent` int(10) DEFAULT NULL COMMENT '租金',
  `rent_method` tinyint(1) DEFAULT NULL COMMENT '租赁方式，1-整租，2-合租',
  `payment_method` tinyint(1) DEFAULT NULL COMMENT '支付方式，1-付一押一，2-付三押一，3-付六押一，4-年付押一，5-其它',
  `house_type` varchar(255) DEFAULT NULL COMMENT '户型，如：2室1厅1卫',
  `covered_area` varchar(10) DEFAULT NULL COMMENT '建筑面积',
  `use_area` varchar(10) DEFAULT NULL COMMENT '使用面积',
  `floor` varchar(10) DEFAULT NULL COMMENT '楼层，如：8/26',
  `orientation` varchar(2) DEFAULT NULL COMMENT '朝向：东、南、西、北',
  `decoration` tinyint(1) DEFAULT NULL COMMENT '装修，1-精装，2-简装，3-毛坯',
  `facilities` varchar(50) DEFAULT NULL COMMENT '配套设施， 如：1,2,3',
  `pic` varchar(200) DEFAULT NULL COMMENT '图片，最多5张',
  `house_desc` varchar(200) DEFAULT NULL COMMENT '描述',
  `contact` varchar(10) DEFAULT NULL COMMENT '联系人',
  `mobile` varchar(11) DEFAULT NULL COMMENT '手机号',
  `time` tinyint(1) DEFAULT NULL COMMENT '看房时间，1-上午，2-中午，3-下午，4-晚上，5-全天',
  `property_cost` varchar(10) DEFAULT NULL COMMENT '物业费',
  `created` datetime DEFAULT NULL,
  `updated` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='房源表';

/*Data for the table `tb_house_resources` */

/*Table structure for table `tb_house_tag` */

DROP TABLE IF EXISTS `tb_house_tag`;

CREATE TABLE `tb_house_tag` (
  `id` bigint(11) NOT NULL AUTO_INCREMENT,
  `house_id` bigint(11) DEFAULT NULL COMMENT '房源id',
  `tag_id` bigint(20) DEFAULT NULL COMMENT '标签',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=297 DEFAULT CHARSET=utf8;

/*Data for the table `tb_house_tag` */

insert  into `tb_house_tag`(`id`,`house_id`,`tag_id`) values (1,1,1),(2,1,2),(3,1,3),(27,2,0),(28,2,1),(29,2,2),(30,1,1),(31,1,2),(32,1,3),(33,1,1),(34,1,2),(35,1,3),(36,1,1),(37,1,2),(38,1,1),(39,1,2),(40,1,1),(41,1,2),(42,1,1),(43,1,2),(44,1,1),(45,1,2),(46,1,1),(47,1,2),(48,1,1),(49,1,2),(50,1,1),(51,1,2),(52,1,1),(53,1,2),(54,1,0),(55,1,0),(56,1,1),(57,1,2),(58,1,3),(59,1,0),(60,1,1),(61,1,2),(62,1,3),(63,1,0),(64,1,1),(65,1,2),(66,1,3),(67,1,0),(68,1,1),(69,1,2),(70,1,3),(71,1,0),(72,1,1),(73,1,2),(74,1,3),(75,1,0),(76,1,1),(77,1,2),(78,1,3),(79,1,0),(80,1,1),(81,1,2),(82,1,3),(83,1,0),(84,1,1),(85,1,2),(86,1,3),(87,1,0),(88,1,1),(89,1,2),(90,1,3),(91,1,0),(92,1,1),(93,1,2),(94,1,3),(95,1,0),(96,1,1),(97,1,2),(98,1,3),(99,1,0),(100,1,1),(101,1,2),(102,1,3),(103,1,0),(104,1,1),(105,1,2),(106,1,3),(107,1,0),(108,1,1),(109,1,2),(110,1,3),(111,2,1),(112,2,2),(113,2,4),(114,1,0),(115,1,1),(116,1,2),(117,1,3),(118,9,4),(119,4,1),(120,4,4),(121,4,3),(122,17,1),(123,17,0),(124,17,2),(125,8,0),(126,8,1),(127,8,3),(128,17,0),(129,17,1),(130,17,2),(131,7,1),(132,7,2),(133,7,3),(134,4,1),(135,4,3),(136,4,4),(137,22,0),(138,22,1),(139,22,0),(140,22,1),(141,22,0),(142,22,1),(143,5,1),(144,5,0),(145,5,2),(146,4,1),(147,4,3),(148,4,4),(149,4,1),(150,4,3),(151,4,4),(152,22,0),(153,22,1),(154,22,0),(155,22,1),(156,11,0),(157,11,1),(158,11,2),(159,11,0),(160,11,1),(161,11,2),(162,13,0),(163,13,1),(164,13,2),(165,13,0),(166,13,1),(167,13,2),(168,11,0),(169,11,1),(170,11,2),(171,11,0),(172,11,1),(173,11,2),(174,11,0),(175,11,1),(176,11,2),(177,13,0),(178,13,1),(179,13,2),(180,13,0),(181,13,1),(182,13,2),(183,22,0),(184,22,1),(185,22,2),(186,22,3),(187,22,0),(188,22,1),(189,22,2),(190,22,3),(191,1,0),(192,1,1),(193,1,2),(194,1,3),(195,22,0),(196,22,1),(197,22,2),(198,22,3),(199,2,1),(200,2,2),(201,2,4),(202,2,1),(203,2,2),(204,2,4),(205,2,1),(206,2,2),(207,2,4),(208,22,0),(209,22,1),(210,22,2),(211,22,3),(212,11,0),(213,11,2),(214,11,4),(215,2,1),(216,2,1),(217,2,2),(218,2,2),(219,2,4),(220,2,4),(221,2,1),(222,2,2),(223,2,4),(224,1,0),(225,1,1),(226,1,2),(227,1,3),(228,1,0),(229,1,1),(230,1,2),(231,1,3),(232,1,0),(233,1,1),(234,1,2),(235,1,3),(236,1,0),(237,1,1),(238,1,2),(239,1,3),(240,2,1),(241,2,2),(242,2,4),(243,11,0),(244,11,2),(245,11,4),(246,2,1),(247,2,2),(248,2,4),(249,5,0),(250,5,1),(251,5,2),(252,1,0),(253,1,1),(254,1,2),(255,1,3),(256,81,0),(257,81,1),(258,81,2),(259,1,0),(260,1,1),(261,1,2),(262,1,3),(263,13,0),(264,13,1),(265,13,2),(266,82,1),(267,82,2),(268,82,3),(269,82,1),(270,82,2),(271,82,3),(272,1,0),(273,1,1),(274,1,2),(275,1,3),(276,88,4),(277,88,2),(278,88,1),(279,26,0),(280,26,1),(281,26,2),(282,26,3),(283,15,1),(284,15,2),(285,15,3),(286,9,4),(287,9,5),(288,12,1),(289,12,3),(290,12,5),(291,12,1),(292,12,3),(293,12,5),(294,15,1),(295,15,2),(296,15,3);

/*Table structure for table `tb_house_watch` */

DROP TABLE IF EXISTS `tb_house_watch`;

CREATE TABLE `tb_house_watch` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `house_id` bigint(20) DEFAULT NULL COMMENT '房源id',
  `user_id` bigint(20) DEFAULT NULL COMMENT '用户id',
  `number` bigint(20) DEFAULT NULL COMMENT '浏览量',
  `update_time` datetime DEFAULT NULL COMMENT '最近时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8;

/*Data for the table `tb_house_watch` */

insert  into `tb_house_watch`(`id`,`house_id`,`user_id`,`number`,`update_time`) values (1,3,2,9,'2021-05-05 12:50:01'),(2,17,2,3,'2021-04-28 00:06:50'),(3,4,2,7,'2021-05-11 11:05:53'),(4,13,2,1,'2021-04-28 00:06:56'),(5,75,2,2,'2021-05-05 12:36:43'),(6,25,10,1,'2021-05-05 13:17:41'),(7,76,11,1,'2021-05-06 15:04:51'),(8,4,11,1,'2021-05-06 15:46:23'),(9,82,11,1,'2021-05-06 15:46:41'),(10,4,12,1,'2021-05-06 16:26:56'),(11,9,12,1,'2021-05-06 16:28:17'),(12,5,2,1,'2021-05-06 20:12:30'),(13,6,2,1,'2021-05-06 20:47:09'),(14,7,2,1,'2021-05-06 20:55:09'),(15,61,2,1,'2021-05-07 08:27:43'),(16,10,2,2,'2021-05-11 11:06:00'),(17,9,2,1,'2021-05-11 11:05:57');

/*Table structure for table `tb_order` */

DROP TABLE IF EXISTS `tb_order`;

CREATE TABLE `tb_order` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `user_id` bigint(20) DEFAULT NULL COMMENT '用户id',
  `house_id` bigint(20) DEFAULT NULL COMMENT '房子id',
  `host_id` bigint(20) DEFAULT NULL COMMENT '房主id',
  `total_price` float DEFAULT NULL COMMENT '总价值',
  `state` tinyint(4) DEFAULT NULL COMMENT '状态，1-未签合同 2-出租中 3-逾期,4-申请退租',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `valid_time` datetime DEFAULT NULL COMMENT '有效时间',
  `time_select` int(3) DEFAULT NULL COMMENT '选择月数',
  `over_time` datetime DEFAULT NULL COMMENT '完成时间',
  `over_state` int(2) DEFAULT NULL COMMENT '退租状态，0-无，1-申请退租，2-退租成功，3-退租失败',
  `deleted` int(1) DEFAULT '0' COMMENT '逻辑删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=61 DEFAULT CHARSET=utf8;

/*Data for the table `tb_order` */

insert  into `tb_order`(`id`,`user_id`,`house_id`,`host_id`,`total_price`,`state`,`create_time`,`valid_time`,`time_select`,`over_time`,`over_state`,`deleted`) values (41,2,22,1,6000,4,'2021-04-14 17:58:43','2020-06-14 17:58:43',2,'2021-04-16 10:39:15',2,0),(42,2,13,2,369,4,'2021-04-13 17:58:58','2021-07-13 17:58:58',3,'2021-04-18 14:07:17',2,0),(43,1,4,4,3699,4,'2021-04-10 17:59:24','2021-06-10 17:59:24',2,'2021-04-16 01:59:54',2,0),(44,1,11,2,25500,3,'2021-04-07 18:00:03','2021-08-07 18:00:03',4,'2021-04-21 00:16:48',1,0),(45,1,27,1,6000,3,'2021-04-11 18:00:23','2021-07-11 18:00:23',3,'2021-04-21 00:19:27',1,0),(46,1,8,2,4197,3,'2021-04-12 18:00:39','2022-04-12 18:00:39',12,'2021-04-21 00:19:29',1,0),(47,2,1,4,6000,4,'2021-04-16 02:37:25','2021-12-16 02:37:25',8,'2021-04-18 14:07:17',2,0),(48,2,2,3,5850,4,'2021-04-16 02:49:48','2021-07-16 02:49:48',3,'2021-04-18 14:07:18',2,0),(49,2,3,1,4200,4,'2021-04-17 09:05:59','2021-07-17 09:05:59',3,'2021-04-18 14:07:18',2,0),(50,2,3,1,4200,3,'2021-04-17 09:06:00','2021-07-17 09:06:00',3,'2021-04-18 14:08:43',3,0),(51,2,2,3,5850,2,'2021-04-18 06:08:13','2021-07-18 06:08:13',3,'2021-05-04 23:03:48',3,0),(52,2,1,4,3000,2,'2021-04-18 12:36:15','2021-06-18 12:36:15',2,'2021-04-21 00:06:48',3,0),(53,2,75,3,6000,2,'2021-05-05 04:36:47','2021-10-05 04:36:47',5,NULL,NULL,0),(54,2,3,1,4200,2,'2021-05-05 04:50:14','2021-08-05 04:50:14',3,NULL,NULL,0),(55,10,25,1,6000,2,'2021-05-05 05:17:58','2021-06-05 05:17:58',1,'2021-05-06 22:15:27',3,0),(56,11,76,1,6000,4,'2021-05-06 07:04:55','2021-09-06 07:04:55',4,'2021-05-06 15:05:04',2,0),(57,2,5,3,5700,3,'2021-05-06 12:12:33','2021-09-06 12:12:33',4,'2021-05-06 22:19:04',1,0),(58,2,6,3,369,2,'2021-05-06 12:47:12','2021-10-06 12:47:12',5,NULL,NULL,0),(59,2,7,3,13800,2,'2021-05-06 12:55:17','2021-09-06 12:55:17',4,'2021-05-07 08:46:35',3,0),(60,2,10,3,12900,2,'2021-05-11 03:06:03','2021-08-11 03:06:03',3,NULL,NULL,0);

/*Table structure for table `tb_tag` */

DROP TABLE IF EXISTS `tb_tag`;

CREATE TABLE `tb_tag` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '标签id',
  `tag_name` varchar(22) DEFAULT NULL COMMENT '标签名字',
  `tag_describe` longtext COMMENT '标签描述',
  `deleted` int(1) DEFAULT '0' COMMENT '逻辑删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

/*Data for the table `tb_tag` */

insert  into `tb_tag`(`id`,`tag_name`,`tag_describe`,`deleted`) values (0,'精选好房','管理员精心挑选的房主',0),(1,'精装','12312312',0),(2,'随时看房','123',0),(3,'拎包入住','',0),(4,'近地铁',NULL,0),(5,'舒适好房','看着就很舒适',0),(6,'123','123',1),(8,'123','123',1),(9,'123','123',1);

/*Table structure for table `tb_tenant` */

DROP TABLE IF EXISTS `tb_tenant`;

CREATE TABLE `tb_tenant` (
  `tenant_id` bigint(18) DEFAULT NULL COMMENT '租客id',
  `tenant_name` varchar(18) DEFAULT NULL COMMENT '租客名字',
  `tenant_phone` varchar(18) DEFAULT NULL COMMENT '租客电话',
  `tenant_account` bigint(18) DEFAULT NULL COMMENT '租客银行卡账号',
  `tenant_email` varchar(18) DEFAULT NULL COMMENT '租客邮箱',
  `tenant_username` varchar(18) DEFAULT NULL COMMENT '租客账号',
  `tenant_password` varchar(18) DEFAULT NULL COMMENT '租客密码',
  `house_id` bigint(18) DEFAULT NULL COMMENT '租房id'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tb_tenant` */

insert  into `tb_tenant`(`tenant_id`,`tenant_name`,`tenant_phone`,`tenant_account`,`tenant_email`,`tenant_username`,`tenant_password`,`house_id`) values (NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL);

/*Table structure for table `tb_user` */

DROP TABLE IF EXISTS `tb_user`;

CREATE TABLE `tb_user` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `username` varchar(64) NOT NULL COMMENT '用户名',
  `real_name` varchar(20) DEFAULT NULL COMMENT '真实名字',
  `avatar` varchar(255) DEFAULT NULL COMMENT '头像',
  `password` varchar(64) DEFAULT NULL COMMENT '密码',
  `email` varchar(64) DEFAULT NULL COMMENT '邮箱',
  `status` int(5) DEFAULT NULL COMMENT '状态',
  `created` datetime DEFAULT NULL COMMENT '创建时间',
  `last_login` datetime DEFAULT NULL COMMENT '最后一次登录',
  `power` int(5) DEFAULT NULL COMMENT '权限',
  `phone` bigint(20) DEFAULT NULL COMMENT '手机号',
  `id_card` bigint(20) DEFAULT NULL COMMENT '身份证',
  `sex` varchar(10) DEFAULT NULL COMMENT '性别',
  `deleted` int(1) DEFAULT '0' COMMENT '是否删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8;

/*Data for the table `tb_user` */

insert  into `tb_user`(`id`,`username`,`real_name`,`avatar`,`password`,`email`,`status`,`created`,`last_login`,`power`,`phone`,`id_card`,`sex`,`deleted`) values (1,'lbb','码云','1_2.png','96e79218965eb72c92a549dd5a330112','1532771197@qq.com',1,'2020-12-13 14:21:58','2021-04-16 10:26:48',1,18433324441,440348822133133300,'女',0),(2,'admin','张三','dd.png','96e79218965eb72c92a549dd5a330112','1532771197@qq.com',1,'2021-02-10 20:09:54','2021-05-11 11:05:48',1,18433324445,440348822133133300,'女',0),(3,'ljz','李四','001be52f32019ae41bc92ac21e11522.jpg','96e79218965eb72c92a549dd5a330112','1532771197@qq.com',1,'2021-03-05 20:10:40','2021-04-19 16:16:43',1,23344412333,440348822133133300,'男',0),(4,'123312','芦苇','dd.jpg','96e79218965eb72c92a549dd5a330112','1532771197@qq.com',1,'2021-04-05 13:45:51','2021-04-05 13:45:51',1,18347727838,344452244333122234,'女',0),(5,'123','王五','1_2.png','96e79218965eb72c92a549dd5a330112','1532771197@qq.com',0,'2021-03-05 20:10:40','2021-04-15 01:26:13',1,18347727838,344452244333122240,'女',0),(9,'lbbqaq','123','','d41d8cd98f00b204e9800998ecf8427e','123@qq.com',1,'2021-04-20 23:13:38','2021-04-20 23:13:38',1,18233323234,442333311444242213,'男',0),(10,'lbbqaqnm','lbb','登录.png','1eefee78c68be69c474421317b1aedc5','123@qq.com',1,'2021-05-05 13:16:19','2021-05-05 13:19:10',1,13212323456,440321199210240000,NULL,0),(11,'lcc','陈思思','以撒2.png','e10adc3949ba59abbe56e057f20f883e','1532771197@qq.com',1,'2021-05-06 11:38:14','2021-05-06 15:25:46',1,18333221233,449828888883382900,NULL,0),(12,'lzz','卢建忠','6181ea223f0285018803e6d6eae54c4.jpg','96e79218965eb72c92a549dd5a330112','12312@qq.com',1,'2021-05-06 15:48:03','2021-05-06 16:25:17',1,18423333223,442334423423423400,NULL,0);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
